{"modelTopology":{"class_name":"Model","config":{"name":"model_1","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"Dense1","class_name":"Dense","config":{"units":10,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Dense1","trainable":true},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"Dense2","class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Dense2","trainable":true},"inbound_nodes":[[["Dense1",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["Dense2",0,0]]},"keras_version":"tfjs-layers 0.7.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./iris_vme.weights.bin"],"weights":[{"name":"Dense1/kernel","shape":[4,10],"dtype":"float32"},{"name":"Dense1/bias","shape":[10],"dtype":"float32"},{"name":"Dense2/kernel","shape":[10,3],"dtype":"float32"},{"name":"Dense2/bias","shape":[3],"dtype":"float32"}]}]}