{
  "modelTopology": {
    "class_name": "Model",
    "config": {
      "name": "model2",
      "layers": [
        {
          "name": "input7",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              6
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input7"
          },
          "inbound_nodes": []
        },
        {
          "name": "input8",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              11
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input8"
          },
          "inbound_nodes": []
        },
        {
          "name": "input9",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              8
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input9"
          },
          "inbound_nodes": []
        },
        {
          "name": "input10",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              5
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input10"
          },
          "inbound_nodes": []
        },
        {
          "name": "input11",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              6
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input11"
          },
          "inbound_nodes": []
        },
        {
          "name": "input12",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              5
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input12"
          },
          "inbound_nodes": []
        },
        {
          "name": "Scarlett_Johansson",
          "class_name": "Dense",
          "config": {
            "units": 136,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "Scarlett_Johansson",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input7",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "Diana",
          "class_name": "Dense",
          "config": {
            "units": 136,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "Diana",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input8",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "Jane_Fonda",
          "class_name": "Dense",
          "config": {
            "units": 136,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "Jane_Fonda",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input9",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "The_Queen",
          "class_name": "Dense",
          "config": {
            "units": 136,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "The_Queen",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input10",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "Julia_Roberts",
          "class_name": "Dense",
          "config": {
            "units": 136,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "Julia_Roberts",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input11",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "Jessica_Alba",
          "class_name": "Dense",
          "config": {
            "units": 136,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "Jessica_Alba",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input12",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "myConcatenate1",
          "class_name": "Concatenate",
          "config": {
            "axis": 1,
            "name": "myConcatenate1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Scarlett_Johansson",
                0,
                0,
                {}
              ],
              [
                "Diana",
                0,
                0,
                {}
              ],
              [
                "Jane_Fonda",
                0,
                0,
                {}
              ],
              [
                "The_Queen",
                0,
                0,
                {}
              ],
              [
                "Julia_Roberts",
                0,
                0,
                {}
              ],
              [
                "Jessica_Alba",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "myConcatenate1Dense4",
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "myConcatenate1Dense4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "myConcatenate1",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "input7",
          0,
          0
        ],
        [
          "input8",
          0,
          0
        ],
        [
          "input9",
          0,
          0
        ],
        [
          "input10",
          0,
          0
        ],
        [
          "input11",
          0,
          0
        ],
        [
          "input12",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "myConcatenate1Dense4",
          0,
          0
        ]
      ]
    },
    "keras_version": "tfjs-layers 0.8.1",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "./myClassifierModel01.weights.bin"
      ],
      "weights": [
        {
          "name": "Scarlett_Johansson/kernel",
          "shape": [
            6,
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "Scarlett_Johansson/bias",
          "shape": [
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "Diana/kernel",
          "shape": [
            11,
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "Diana/bias",
          "shape": [
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "Jane_Fonda/kernel",
          "shape": [
            8,
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "Jane_Fonda/bias",
          "shape": [
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "The_Queen/kernel",
          "shape": [
            5,
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "The_Queen/bias",
          "shape": [
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "Julia_Roberts/kernel",
          "shape": [
            6,
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "Julia_Roberts/bias",
          "shape": [
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "Jessica_Alba/kernel",
          "shape": [
            5,
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "Jessica_Alba/bias",
          "shape": [
            136
          ],
          "dtype": "float32"
        },
        {
          "name": "myConcatenate1Dense4/kernel",
          "shape": [
            816,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "myConcatenate1Dense4/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
