{
	"modelTopology": {
		"class_name": "Sequential",
		"config": [
			{
				"class_name": "Dense",
				"config": {
					"units": 3,
					"activation": "sigmoid",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "VarianceScaling",
						"config": {
							"scale": 1,
							"mode": "fan_avg",
							"distribution": "normal",
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"name": "hiddenLayer",
					"trainable": true,
					"batch_input_shape": [
						null,
						2
					],
					"dtype": "float32"
				}
			},
			{
				"class_name": "Dense",
				"config": {
					"units": 1,
					"activation": "sigmoid",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "VarianceScaling",
						"config": {
							"scale": 1,
							"mode": "fan_avg",
							"distribution": "normal",
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"name": "outputLayer",
					"trainable": true
				}
			}
		],
		"keras_version": "tfjs-layers 0.6.1",
		"backend": "tensor_flow.js"
	},
	"weightsManifest": [
		{
			"paths": [
				"./my-file-model-01.weights.bin"
			],
			"weights": [
				{
					"name": "hiddenLayer/kernel",
					"shape": [
						2,
						3
					],
					"dtype": "float32"
				},
				{
					"name": "hiddenLayer/bias",
					"shape": [
						3
					],
					"dtype": "float32"
				},
				{
					"name": "outputLayer/kernel",
					"shape": [
						3,
						1
					],
					"dtype": "float32"
				},
				{
					"name": "outputLayer/bias",
					"shape": [
						1
					],
					"dtype": "float32"
				}
			]
		}
	]
}
