{
  "modelTopology": {
    "class_name": "Sequential",
    "config": [
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten_Flatten1",
          "trainable": true,
          "batch_input_shape": [
            null,
            28,
            28,
            1
          ],
          "dtype": "float32"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "units": 42,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "name": "dense_Dense1",
          "trainable": true
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "units": 10,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1,
              "mode": "fan_avg",
              "distribution": "normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "name": "dense_Dense2",
          "trainable": true
        }
      }
    ],
    "keras_version": "tfjs-layers 0.8.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "./my-mnist01.weights.bin"
      ],
      "weights": [
        {
          "name": "dense_Dense1/kernel",
          "shape": [
            784,
            42
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/bias",
          "shape": [
            42
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/kernel",
          "shape": [
            42,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
